Revit 2016 API
DirectShape.SetGUIDs Method
 Sets the GUID of the application that has created this DirectShape element and the GUID of the native data that was the source of this DirectShape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2015
Syntax
C#
public void SetGUIDs(
	string appGUID,
	string appDataGUID
)
Visual Basic
Public Sub SetGUIDs ( _
	appGUID As String, _
	appDataGUID As String _
)
Visual C++
public:
void SetGUIDs(
	String^ appGUID,
	String^ appDataGUID
)
Parameters
appGUID
Type: System.String
 GUID of the application.
appDataGUID
Type: System.String
 GUID of the native data.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
DirectShape Class
Autodesk.Revit.DB Namespace